import { Typography } from "@material-tailwind/react";
import Image from "next/image";
import FactoryImg from "@public/pyryatyn.jpg";
import { Layout } from "@components/common";

export default function About() {
  return (
    <Layout>
      <Typography className="font-medium text-3xl">
        Пирятинський сирзавод
      </Typography>
      <div className="grid grid-cols-2 gap-10">
        <div className="flex flex-col">
          <div className="flex flex-col gap-2 flex-grow">
            <Typography>
              Сьогодні на українському ринку представлено десятки найменувань та
              сортів сиру та чимало їх виробників. Але лише одиниці з них
              вважаються провідними експертами сирної справи, що здатні
              запроваджувати стандарти та визначати тенденції розвитку всієї
              галузі. Саме таким підприємством є Пирятинський сирзавод,
              продукція якого відома під торговою маркою «Пирятин».
            </Typography>
            <Typography>
              Секрет успіху Пирятинського сирзаводу складається з трьох
              компонентів. По-перше — це багаті традиції та набутий
              десятиліттями досвід. По-друге — професійна майстерність, в
              поєднанні із щирим вболіванням за улюблену справу. І, нарешті —
              найсучасніше технологічне оснащення.
            </Typography>
            <Typography>
              Головна особливість та перевага сирної технології Пирятинського
              заводу — це те, що сир виготовляється виключно з натурального
              молока, без рослинних домішок, без застосування сухого молока.
              Основні напрямки діяльності заводу — це виробництво твердих та
              плавлених сирів. Окрім цього, на заводі виготовляється
              цільномолочна продукція, суха демінералізована молочна сироватка
              та вершкове масло.
            </Typography>
            <Typography>
              У цілях безпеки та стабільного забезпечення підприємства холодом
              проведено реконструкцію компресорного цеху, де встановлено сучасне
              японське обладнання, що дозволило більш ефективно використовувати
              енергоресурси.
            </Typography>
          </div>
          <div className="py-4 px-8 bg-primary-blue rounded-xl text-white">
            Полтавська обл., Пирятинський район, м. Пирятин, вул. Сумська 1
          </div>
        </div>
        <Image src={FactoryImg} height={800} width={1000} alt="factory-img" />
      </div>
    </Layout>
  );
}
